src/cf/Documents/уатСчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатСчетФактураВыданный</Name>
			<BasedOn>
				<xr:Item>Document.уатРеализацияУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСчетаФактурыВыставленного</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выставлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТиповойКонфигурации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснованиеТиповаяКонфигурация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьИсправлениеИсходногоДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатСчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежноРасчетныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСчетаФактурыНаАванс</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидСчетаФактурыВыставленного.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидСчетаФактурыВыставленного</Name>
			<Comment>Вид выставленного счета-фактуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КорректировочнаяСправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитентаНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРеализацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСуммовуюРазницу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяСправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатСчетФактураВыданный/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияСервер.НастроитьПолеДоговорКонтрагента(Элементы.ДоговорКонтрагента, "Объект.Организация", "Объект.Контрагент", "СПокупателем");
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	ЗаполнитьСписокКодовОпераций();
	
	Договор = Объект.ДоговорКонтрагента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// Обход проверки АПК на экспортный метод формы
	Если Ложь Тогда
		Оповещ = Новый ОписаниеОповещения("Подключаемый_ПриИзмененииДоговораЛокальныеОбработчики", ЭтотОбъект);
	КонецЕсли;
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтобразитьНадписьКодВидаОперации();
	
	// Установить видимость реквизитов и заголовков колонок.
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.уатСчетФактураВыданный.Форма.ФормаДокументыОснования" Тогда
		Модифицированность	= Истина;
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		ОтобразитьНадписьКодВидаОперации();
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	Оповестить("Запись_СчетФактураВыданный", ПараметрыЗаписи, Объект.Ссылка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// уатУправлениеАвтотранспортом.МодификацияКонфигурации
&НаКлиенте
Процедура Подключаемый_уатВыполнитьКоманду(Команда)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации

&НаКлиенте
Процедура ИзменитьОснование(Команда)
	
	ВыбратьОснование();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатежныеДокументы(Команда)
	Если Объект.ПлатежноРасчетныеДокументы.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Tabular section will be cleared! Continue?';ru='Табличная часть будет очищена! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПлатежныеДокументыОтвет", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьДатыНомераПлатежноРасчетныхДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатежныеДокументыОтвет(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДатыНомераПлатежноРасчетныхДокументов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ДокументОснование = Неопределено;
	Объект.ДокументыОснования.Очистить();
	Объект.ПлатежноРасчетныеДокументы.Очистить();
	
	//ЗаполнитьПорядокВыставленияСчетаФактуры();
	
	Объект.СуммаДокумента = 0;
	Объект.СуммаНДС = 0;
	
	ПриИзмененииКонтрагентаИлиОрганизации();
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКонтрагентаИлиОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если Объект.ДоговорКонтрагента <> Договор И ЕстьОснованиеСДругимДоговором() Тогда
		ТекстНСТР = НСтр("en='The documents-foundations with the contract different from the empire will be removed!" +
			" Continue?';ru='Будут удалены документы-основания с договором, отличающимся от выбранного," +
			" и перезаполнены платежно-расчетные документы! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ДоговорКонтрагентаПриИзмененииОтвет", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);
        Возврат;
	КонецЕсли;
	
	Договор = Объект.ДоговорКонтрагента;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзмененииОтвет(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УдалитьОснованияСДругимДоговором();
		ЗаполнитьДатыНомераПлатежноРасчетныхДокументов();
		УстановитьВидимость();
	Иначе
		Объект.ДоговорКонтрагента = Договор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьОснованиеСДругимДоговором()
	Для Каждого ТекОснование Из Объект.ДокументыОснования Цикл
		Если ТекОснование.ДокументОснование.ДоговорКонтрагента <> Объект.ДоговорКонтрагента Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура УдалитьОснованияСДругимДоговором()
	
	Объект.СуммаДокумента = 0;
	Объект.СуммаНДС       = 0;
	
	Сч = Объект.ДокументыОснования.Количество()-1;
	Пока Сч >= 0 Цикл
		Если Объект.ДокументыОснования[Сч].ДокументОснование.ДоговорКонтрагента <> Объект.ДоговорКонтрагента Тогда
			Объект.ДокументыОснования.Удалить(Сч);
		Иначе
			Объект.СуммаДокумента = Объект.СуммаДокумента + Объект.ДокументыОснования[Сч].ДокументОснование.СуммаДокумента;
			Объект.СуммаНДС = Объект.СуммаНДС + Объект.ДокументыОснования[Сч].ДокументОснование.Услуги.Итог("СуммаНДС");
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	
	Если Объект.ДокументыОснования.Количество() = 0 Тогда
		Объект.ДокументОснование = Неопределено;
	Иначе
		Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонтрагентаИлиОрганизации()
	ДанныеОбменаССервером = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Дата");
	ЗаполнитьЗначенияСвойств(ДанныеОбменаССервером, Объект);
	// Получим данные с сервера
	ДанныеОбменаССервером.ДоговорКонтрагента = Объект.ДоговорКонтрагента;
	ЗначенияДляЗаполнения = ИзменениеКонтрагентаСервер(ДанныеОбменаССервером);
	Объект.ДоговорКонтрагента = ЗначенияДляЗаполнения.ДоговорКонтрагента;
	Договор = Объект.ДоговорКонтрагента;
	
	УдалитьОснованияСДругимДоговором();
	ЗаполнитьДатыНомераПлатежноРасчетныхДокументов();
	УстановитьВидимость();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменениеКонтрагентаСервер(ДанныеДляЗаполнения)
	СтруктураПараметровДляПолученияДоговора = 
		уатЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
	
	ЗначенияДляЗаполнения = уатОбщегоНазначенияСервер.ПриИзмененииЗначенияКонтрагента(ДанныеДляЗаполнения,
		СтруктураПараметровДляПолученияДоговора);
	Возврат ЗначенияДляЗаполнения;
КонецФункции

&НаКлиенте
Процедура НадписьВыборНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОснование();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДокументыОснованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОснование();
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаОперацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущийКод = Элемент.СписокВыбора.НайтиПоЗначению(Объект.КодВидаОперации);
	ОповещениеВыбора = Новый ОписаниеОповещения("КодВидаОперацииНачалоВыбораЗавершение",ЭтотОбъект);
	ПоказатьВыборИзСписка(ОповещениеВыбора, Элемент.СписокВыбора, Элемент, ТекущийКод);
КонецПроцедуры

&НаКлиенте
Процедура КодВидаОперацииНачалоВыбораЗавершение(ВыбранныйКод, ДополнительныеПараметры) Экспорт
    Если ВыбранныйКод <> Неопределено Тогда
		Модифицированность = Истина;
		Объект.КодВидаОперации = ВыбранныйКод.Значение;
		НадписьВидОперации = Сред(ВыбранныйКод.Представление, 5);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КодВидаОперацииПриИзменении(Элемент)
	ОтобразитьНадписьКодВидаОперации();
КонецПроцедуры

&НаКлиенте
Процедура ВыставленПриИзменении(Элемент)
	Если Объект.Выставлен Тогда
		Объект.ДатаВыставления = Объект.Дата;
	Иначе
		Объект.ДатаВыставления = '00010101';
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыПлатежноРасчетныеДокументы

&НаКлиенте
Процедура ПлатежноРасчетныеДокументыНомерСчетаФактурыНаАвансНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ВидСчетаФактуры, ДоговорКонтрагента",
		ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.НаАванс"),
		Объект.ДоговорКонтрагента));
	Оповещ = Новый ОписаниеОповещения("ПлатежноРасчетныеДокументыНомерСчетаФактурыНаАвансВыбор", ЭтотОбъект);
	ОткрытьФорму("Документ.уатСчетФактураВыданный.ФормаВыбора", ПараметрыФормы,,,,, Оповещ);
КонецПроцедуры

&НаКлиенте
Процедура ПлатежноРасчетныеДокументыНомерСчетаФактурыНаАвансВыбор(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекСтрока = Элементы.ПлатежноРасчетныеДокументы.ТекущиеДанные;
		ТекСтрока.НомерСчетаФактурыНаАванс = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Результат, "Номер");
		ТекСтрока.ДатаСчетаФактурыНаАванс  = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Результат, "Дата");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьВидимость()
	
	КоличествоОснований = Объект.ДокументыОснования.Количество();
	флЕстьНесопоставленныеОснования = Ложь;
	Для Каждого ТекОснование Из Объект.ДокументыОснования Цикл
		Если НЕ ЗначениеЗаполнено(ТекОснование.ДокументОснование)
			И ЗначениеЗаполнено(ТекОснование.ДокументОснованиеТиповаяКонфигурация) Тогда
			флЕстьНесопоставленныеОснования = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Объект.ЗагруженИзТиповойКонфигурации И флЕстьНесопоставленныеОснования Тогда
		Если КоличествоОснований = 0 Тогда
			НадписьДокументыОснования = "Не указаны";
		Иначе
			Предмет = "документ,документа,документов,м,,,,0";
			НадписьДокументыОснования = ОбщегоНазначенияБПКлиентСервер.ПредставлениеСсылкиПредмета(
				Предмет, "док", Объект.ДокументыОснования[0].ДокументОснованиеТиповаяКонфигурация, КоличествоОснований);
		КонецЕсли;
		
		Элементы.НадписьВыбор.Видимость               = Ложь;
		Элементы.ГруппаНадписьОдноОснование.Видимость = Ложь;
		Элементы.НадписьДокументыОснования.Видимость  = Истина;
		Элементы.ГруппаЗагруженИзТиповой.Видимость    = Истина;
		
		ТолькоПросмотр = Истина;
	Иначе
		Если КоличествоОснований = 0 Тогда
			НадписьВыбор = НСтр("ru = 'Выбор'; en = 'Choice'");
		ИначеЕсли КоличествоОснований > 1 Тогда
			Предмет = "документ,документа,документов,м,,,,0";
			НадписьДокументыОснования = ОбщегоНазначенияБПКлиентСервер.ПредставлениеСсылкиПредмета(
				Предмет, "док", Объект.ДокументыОснования[0].ДокументОснование, КоличествоОснований);
		КонецЕсли;
		
		Элементы.НадписьВыбор.Видимость               = КоличествоОснований = 0;
		Элементы.ГруппаНадписьОдноОснование.Видимость = КоличествоОснований = 1;
		Элементы.НадписьДокументыОснования.Видимость  = КоличествоОснований > 1;
		Элементы.ГруппаЗагруженИзТиповой.Видимость    = Ложь;
	КонецЕсли;
	
	Элементы.ДатаВыставления.Доступность = Объект.Выставлен;
	Элементы.НомерИсправления.Видимость = ЗначениеЗаполнено(Объект.НомерИсправления);
	
	Элементы.ПлатежноРасчетныеДокументыНомерСчетаФактурыНаАванс.Видимость = (Объект.Дата >= Дата(2026, 01, 01));
	Элементы.ПлатежноРасчетныеДокументыДатаСчетаФактурыНаАванс.Видимость  = (Объект.Дата >= Дата(2026, 01, 01));
			
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснование()
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'; en = 'Organization'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Организация", "Объект" , ЕстьОшибкиЗаполнения);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Контрагент'; en = 'Counterparty'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Контрагент", "Объект" , ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьСтруктуруПараметровФормы();
	ОткрытьФорму("Документ.уатСчетФактураВыданный.Форма.ФормаДокументыОснования",
		ПараметрыФормы,	ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФормы()
		
	ЗначенияЗаполнения 	= Новый Структура;
	Если Объект.ДокументыОснования.Количество() > 0 Тогда 
		ЗначенияЗаполнения.Вставить("СписокДокументовОснований", Новый СписокЗначений);
		Для Каждого СтрокаТаблицы Из Объект.ДокументыОснования Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументОснование) Тогда
				ЗначенияЗаполнения.СписокДокументовОснований.Добавить(СтрокаТаблицы.ДокументОснование);
			Иначе
				ЗначенияЗаполнения.СписокДокументовОснований.Добавить(СтрокаТаблицы.ДокументОснованиеТиповаяКонфигурация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЗначенияЗаполнения.Вставить("ТипСчетаФактуры", "Выданный");
	ЗначенияЗаполнения.Вставить("ВидСчетаФактуры", Объект.ВидСчетаФактуры);
	ЗначенияЗаполнения.Вставить("Исправление", ЗначениеЗаполнено(Объект.НомерИсправления));
	ЗначенияЗаполнения.Вставить("СчетФактура", Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("Организация", Объект.Организация);
	ЗначениеОтбора.Вставить("Контрагент",  Объект.Контрагент);
	ЗначениеОтбора.Вставить("Договор",     Объект.ДоговорКонтрагента);
	ЗначениеОтбора.Вставить("Валюта",      Объект.ВалютаДокумента);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения); 
	СтруктураПараметров.Вставить("Отбор", ЗначениеОтбора);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	Объект.ДокументыОснования.Очистить();
	Объект.ДокументОснование = Неопределено;

	Объект.СуммаДокумента = 0;
	Объект.СуммаНДС       = 0;
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Объект.ПлатежноРасчетныеДокументы.Очистить();
	Иначе
		Для Каждого СтрокаСписка Из ВыбранноеЗначение Цикл
			Если СтрокаСписка.Значение.Пустая() Тогда
				Продолжить;
			КонецЕсли; 
			СтрокаТаблицы = Объект.ДокументыОснования.Добавить();
			СтрокаТаблицы.ДокументОснование = СтрокаСписка.Значение;
			
			Объект.СуммаДокумента = Объект.СуммаДокумента + СтрокаТаблицы.ДокументОснование.СуммаДокумента;
			Объект.СуммаНДС = Объект.СуммаНДС + СтрокаТаблицы.ДокументОснование.Услуги.Итог("СуммаНДС");
		КонецЦикла;
		
		Если Объект.ДокументыОснования.Количество() > 0 Тогда
			Объект.ДокументОснование = Объект.ДокументыОснования[0].ДокументОснование;
		КонецЕсли;
	
		ЗаполнитьДатыНомераПлатежноРасчетныхДокументов();
	КонецЕсли;
	
	УстановитьКодВидаОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыНомераПлатежноРасчетныхДокументов()
	МассивОснований	= ОбщегоНазначения.ВыгрузитьКолонку(Объект.ДокументыОснования, "ДокументОснование", Истина);
	Объект.ПлатежноРасчетныеДокументы.Загрузить(
		Документы.уатСчетФактураВыданный.ДатыНомераПлатежноРасчетныхДокументов(МассивОснований));
КонецПроцедуры
	
&НаСервере
Процедура УстановитьКодВидаОперацииНаСервере(КодВидаОперацииОснования = Неопределено)
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Дата",						Объект.Дата);
	СтруктураПараметров.Вставить("ВидСчетаФактуры",				Объект.ВидСчетаФактуры);
	СтруктураПараметров.Вставить("Исправление",					ЗначениеЗаполнено(Объект.НомерИсправления));
	СтруктураПараметров.Вставить("Контрагент",					Объект.Контрагент);
	СтруктураПараметров.Вставить("ДоговорКонтрагента",			Объект.ДоговорКонтрагента);
	СтруктураПараметров.Вставить("КодВидаОперации",				Объект.КодВидаОперации);
	СтруктураПараметров.Вставить("ДокументыОснования",			Объект.ДокументыОснования.Выгрузить(,"ДокументОснование"));
	
	Объект.КодВидаОперации	= Документы.уатСчетФактураВыданный.ПолучитьКодВидаОперации(СтруктураПараметров, КодВидаОперацииОснования);
КонецПроцедуры

// Формирует список кодов видов операций, актуальный на переданную дату.
//
// Параметры:
//   ЧастьЖурнала        - Перечисления.ЧастиЖурналаУчетаСчетовФактур - список различается
//                         для полученных и выставленных счетов-фактур.
//   СписокКодовОпераций - СписокЗначений - список выбора элемента формы, в который помещается
//                         формируемый список кодов видов операций.
//   Дата                - Дата - дата, на которую требуется получить список кодов видов операций.
//
&НаСервере
Процедура ЗаполнитьСписокКодовОпераций()
	
	Если Объект.Дата >= '20240401' Тогда
		// С 1 апреля 2024 года используется дополнительный код, рекомендованный в письме ФНС от 06.06.2024 № ЕА-4-3/6295@.
		ВерсияКодовВидовОпераций = 5;
	ИначеЕсли Объект.Дата >= '20180101' Тогда
		// С 1 января 2018 года используются дополнительные коды, рекомендованные в письмах ФНС:
		// N СД-4-3/10@ от 09.01.2018;
		// N СД-4-3/532@ от 16.01.2018;
		// N СД-4-3/480@ от 16.01.2018.
		ВерсияКодовВидовОпераций = 4;
	ИначеЕсли Объект.Дата >= '20160701' Тогда
		// С 1 июля 2016 года действует перечень, 
		// утвержденный приказом ФНС от 14.03.2016 N ММВ-7-3/136@.
		ВерсияКодовВидовОпераций = 3;
	ИначеЕсли Объект.Дата >= '20150101' Тогда
		// С 1 января 2015 года действует перечень,
		// утвержденный письмом ФНС от 22.01.2015 N ГД-4-3/794@.
		ВерсияКодовВидовОпераций = 2;
	Иначе
		// До 1 января 2015 года действует перечень,
		// утвержденный приказом ФНС 14.02.2012 N ММВ-7-3/83@.
		ВерсияКодовВидовОпераций = 1;
	КонецЕсли;
	
	СписокКодовОпераций = Новый СписокЗначений;
	Если ВерсияКодовВидовОпераций = 1 Тогда
		СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализованные товары, работы, услуги'; en = '01 - Sold goods, works, services'"));
		СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'; en = '02 - Received advances'"));
		СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат поставщику'; en = '03 - Return to the supplier'"));
		СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'; en = '04 - Consignor goods, works, services'"));
		СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'; en = '05 - Advances for consignor goods, works, services'"));
		СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'; en = '06 - Tax agent, art. 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("07", НСтр("ru = '07 - Списание за счет прибыли, пп.2 п.1 ст. 146 НК'; en = '07 - Debiting out of profit, subcl. 2, cl. 1, art. 146 of the Tax Code'"));
		СписокКодовОпераций.Добавить("08", НСтр("ru = '08 - Строительно-монтажные работы, пп.3 п.1 ст. 146 НК'; en = '08 - Construction and installation works, subcl. 3, cl. 1, art. 146 of the Tax Code'"));
		СписокКодовОпераций.Добавить("09", НСтр("ru = '09 - Суммы, связанные с расчетами по оплате, ст. 162 НК'; en = '09 - Amounts related to payment settlements, art. 162 of TC'"));
		СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'; en = '10 - Donation of goods, works, services'"));
		СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Реализованные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'; en = '11 - Sold goods, rights, cl.3, 4, 5.1, art. 154, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы полученные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'; en = '12 - Advances received for goods, rights, cl.3,4,5.1, art. 154, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'; en = '13 - Capital construction, modernization (reconstruction) of real estate'"));
	ИначеЕсли ВерсияКодовВидовОпераций = 2 Тогда
		СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализованные товары, работы, услуги'; en = '01 - Sold goods, works, services'"));
		СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'; en = '02 - Received advances'"));
		СписокКодовОпераций.Добавить("03", НСтр("ru = '03 - Возврат поставщику'; en = '03 - Return to the supplier'"));
		СписокКодовОпераций.Добавить("04", НСтр("ru = '04 - Товары, работы, услуги комитента'; en = '04 - Consignor goods, works, services'"));
		СписокКодовОпераций.Добавить("05", НСтр("ru = '05 - Авансы за товары, работы, услуги комитента'; en = '05 - Advances for consignor goods, works, services'"));
		СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'; en = '06 - Tax agent, art. 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("07", НСтр("ru = '07 - Списание за счет прибыли, пп.2 п.1 ст. 146 НК'; en = '07 - Debiting out of profit, subcl. 2, cl. 1, art. 146 of the Tax Code'"));
		СписокКодовОпераций.Добавить("08", НСтр("ru = '08 - Строительно-монтажные работы, пп.3 п.1 ст. 146 НК'; en = '08 - Construction and installation works, subcl. 3, cl. 1, art. 146 of the Tax Code'"));
		СписокКодовОпераций.Добавить("09", НСтр("ru = '09 - Суммы, связанные с расчетами по оплате, ст. 162 НК'; en = '09 - Amounts related to payment settlements, art. 162 of TC'"));
		СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'; en = '10 - Donation of goods, works, services'"));
		СписокКодовОпераций.Добавить("11", НСтр("ru = '11 - Реализованные товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'; en = '11 - Sold goods, rights, cl.3, 4, 5.1, art. 154, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("12", НСтр("ru = '12 - Авансы полученные за товары, права, п.3,4,5.1 ст. 154, пп.1-4 ст. 155 НК'; en = '12 - Advances received for goods, rights, cl.3,4,5.1, art. 154, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'; en = '13 - Capital construction, modernization (reconstruction) of real estate'"));
		СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'; en = '16 - Return from a customer who does not pay VAT'"));
		СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'; en = '18 - Change of shipped goods (works, services) cost toward decrease'"));
		СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'; en = '21 - VAT restoration, cl. 8, art. 145, cl. 3, art. 170, art. 171.1 of the Tax Code and in case of transactions subject to taxation at a rate of 0%'"));
		СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Счета-фактуры не составляются по письменному согласию сторон'; en = '26 - Tax invoices are not made up by written consent of the parties'"));
		СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'; en = '27 - Collective commission tax invoice, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'; en = '28 - Collective commission tax invoice for advance, cl. 3.1 of article 169 of TC'"));
	ИначеЕсли ВерсияКодовВидовОпераций = 3 Тогда
		СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'; en = '01 - Sale of goods, works, services and operations equal to it '"));
		СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'; en = '02 - Received advances'"));
		СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'; en = '06 - Tax agent, art. 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'; en = '10 - Donation of goods, works, services'"));
		СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'; en = '13 - Capital construction, modernization (reconstruction) of real estate'"));
		СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'; en = '14 - Sale of rights, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'; en = '15 - Joint sale of own and consigned goods, works, services'"));
		СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'; en = '16 - Return from a customer who does not pay VAT'"));
		СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'; en = '18 - Change of shipped goods (works, services) cost toward decrease'"));
		СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'; en = '21 - VAT restoration, cl. 8, art. 145, cl. 3, art. 170, art. 171.1 of the Tax Code and in case of transactions subject to taxation at a rate of 0%'"));
		СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'; en = '26 - Sale of goods, works, services to individuals who do not pay VAT, advance receipt'"));
		СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'; en = '27 - Collective commission tax invoice, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'; en = '28 - Collective commission tax invoice for advance, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'; en = '29 - Adjustment according to cl. 6, art. 105.3 of TC'"));
		СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'; en = '30 - Goods shipment to SEZ of Kaliningrad Oblast, par. 1, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
		СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'; en = '31 - VAT payment to SEZ of Kaliningrad Oblast, par. 2, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
	ИначеЕсли ВерсияКодовВидовОпераций = 4 Тогда 
		СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'; en = '01 - Sale of goods, works, services and operations equal to it '"));
		СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'; en = '02 - Received advances'"));
		СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'; en = '06 - Tax agent, art. 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'; en = '10 - Donation of goods, works, services'"));
		СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'; en = '13 - Capital construction, modernization (reconstruction) of real estate'"));
		СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'; en = '14 - Sale of rights, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'; en = '15 - Joint sale of own and consigned goods, works, services'"));
		СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'; en = '16 - Return from a customer who does not pay VAT'"));
		СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'; en = '17 - Return from a customer-individual'"));
		СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'; en = '18 - Change of shipped goods (works, services) cost toward decrease'"));
		СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'; en = '21 - VAT restoration, cl. 8, art. 145, cl. 3, art. 170, art. 171.1 of the Tax Code and in case of transactions subject to taxation at a rate of 0%'"));
		СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'; en = '26 - Sale of goods, works, services to individuals who do not pay VAT, advance receipt'"));
		СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'; en = '27 - Collective commission tax invoice, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'; en = '28 - Collective commission tax invoice for advance, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'; en = '29 - Adjustment according to cl. 6, art. 105.3 of TC'"));
		СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'; en = '30 - Goods shipment to SEZ of Kaliningrad Oblast, par. 1, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
		СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'; en = '31 - VAT payment to SEZ of Kaliningrad Oblast, par. 2, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
		
		// Коды, введенные в действие с 1 января 2018 года.
		СписокКодовОпераций.Добавить("33", НСтр("ru = '33 - Авансы полученные за товары п.8 ст. 161 НК'; en = '33 - Advances received for goods, paragraph 8, Article 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("34", НСтр("ru = '34 - Реализация товаров п.8 ст. 161 НК'; en = '34 - Sale of goods, paragraph 8, Article 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("35", НСтр("ru = '35 - Оформление документа для компенсации НДС гражданину иностранного государства'; en = '35 - Registration of a document for VAT compensation to a citizen of a foreign country'"));
		СписокКодовОпераций.Добавить("37", НСтр("ru = '37 - Реализация сырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'; en = '37 - Sale of raw materials for export at a rate of 18%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("38", НСтр("ru = '38 - Реализация несырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'; en = '38 - Sale of non-commodity goods for export at a rate of 18%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("39", НСтр("ru = '39 - Реализация несырьевых товаров на экспорт по ставке 10%, п.7 ст.164 НК'; en = '39 - Sale of non-commodity goods for export at a rate of 10%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("40", НСтр("ru = '40 - Реализация работ (услуг) в отношении экспортируемых товаров по ставке 18%, пп.2.1-2.5,2.7 и 2.8 п.1, п.7 ст.164 НК'; en = '40 - Sale of works (services) in relation to exported goods at a rate of 18%, paragraphs 2.1-2.5, 2.7 and 2.8, paragraph 1, paragraph 7, Article 164 of the Tax Code'"));
	ИначеЕсли ВерсияКодовВидовОпераций = 5 Тогда 
		СписокКодовОпераций.Добавить("01", НСтр("ru = '01 - Реализация товаров, работ, услуг и операции, приравненные к ней'; en = '01 - Sale of goods, works, services and operations equal to it '"));
		СписокКодовОпераций.Добавить("02", НСтр("ru = '02 - Авансы полученные'; en = '02 - Received advances'"));
		СписокКодовОпераций.Добавить("06", НСтр("ru = '06 - Налоговый агент, ст. 161 НК'; en = '06 - Tax agent, art. 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("10", НСтр("ru = '10 - Безвозмездная передача товаров, работ, услуг'; en = '10 - Donation of goods, works, services'"));
		СписокКодовОпераций.Добавить("13", НСтр("ru = '13 - Капитальное строительство, модернизация (реконструкция) объектов недвижимости'; en = '13 - Capital construction, modernization (reconstruction) of real estate'"));
		СписокКодовОпераций.Добавить("14", НСтр("ru = '14 - Реализация прав, пп.1-4 ст. 155 НК'; en = '14 - Sale of rights, subcl. 1-4, art. 155 of TC'"));
		СписокКодовОпераций.Добавить("15", НСтр("ru = '15 - Совместная реализация собственных и комиссионных товаров, работ, услуг'; en = '15 - Joint sale of own and consigned goods, works, services'"));
		СписокКодовОпераций.Добавить("16", НСтр("ru = '16 - Возврат от покупателя-неплательщика НДС'; en = '16 - Return from a customer who does not pay VAT'"));
		СписокКодовОпераций.Добавить("17", НСтр("ru = '17 - Возврат от покупателя-физического лица'; en = '17 - Return from a customer-individual'"));
		СписокКодовОпераций.Добавить("18", НСтр("ru = '18 - Изменение стоимости отгруженных товаров (работ, услуг) в сторону уменьшения'; en = '18 - Change of shipped goods (works, services) cost toward decrease'"));
		СписокКодовОпераций.Добавить("21", НСтр("ru = '21 - Восстановление НДС, п.8 ст. 145, п.3 ст. 170, ст. 171.1 НК, а также при операциях, облагаемых по ставке 0%'; en = '21 - VAT restoration, cl. 8, art. 145, cl. 3, art. 170, art. 171.1 of the Tax Code and in case of transactions subject to taxation at a rate of 0%'"));
		СписокКодовОпераций.Добавить("26", НСтр("ru = '26 - Реализация товаров, работ, услуг неплательщикам НДС, получение авансов'; en = '26 - Sale of goods, works, services to individuals who do not pay VAT, advance receipt'"));
		СписокКодовОпераций.Добавить("27", НСтр("ru = '27 - Сводный комиссионный счет-фактура, п.3.1 ст. 169 НК'; en = '27 - Collective commission tax invoice, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("28", НСтр("ru = '28 - Сводный комиссионный счет-фактура на аванс, п.3.1 ст. 169 НК'; en = '28 - Collective commission tax invoice for advance, cl. 3.1 of article 169 of TC'"));
		СписокКодовОпераций.Добавить("29", НСтр("ru = '29 - Корректировка по п.6 ст. 105.3 НК'; en = '29 - Adjustment according to cl. 6, art. 105.3 of TC'"));
		СписокКодовОпераций.Добавить("30", НСтр("ru = '30 - Отгрузка товаров в ОЭЗ Калининградской обл., абз.1 пп.1.1 п.1 ст. 151 НК'; en = '30 - Goods shipment to SEZ of Kaliningrad Oblast, par. 1, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
		СписокКодовОпераций.Добавить("31", НСтр("ru = '31 - Уплата НДС в ОЭЗ Калининградской обл., абз.2 пп.1.1 п.1 ст. 151 НК'; en = '31 - VAT payment to SEZ of Kaliningrad Oblast, par. 2, subcl. 1.1, cl. 1, art. 151 of the Tax Code'"));
		
		// Коды, введенные в действие с 1 января 2018 года.
		СписокКодовОпераций.Добавить("33", НСтр("ru = '33 - Авансы полученные за товары п.8 ст. 161 НК'; en = '33 - Advances received for goods, paragraph 8, Article 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("34", НСтр("ru = '34 - Реализация товаров п.8 ст. 161 НК'; en = '34 - Sale of goods, paragraph 8, Article 161 of the Tax Code'"));
		СписокКодовОпераций.Добавить("35", НСтр("ru = '35 - Оформление документа для компенсации НДС гражданину иностранного государства'; en = '35 - Registration of a document for VAT compensation to a citizen of a foreign country'"));
		СписокКодовОпераций.Добавить("37", НСтр("ru = '37 - Реализация сырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'; en = '37 - Sale of raw materials for export at a rate of 18%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("38", НСтр("ru = '38 - Реализация несырьевых товаров на экспорт по ставке 18%, п.7 ст.164 НК'; en = '38 - Sale of non-commodity goods for export at a rate of 18%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("39", НСтр("ru = '39 - Реализация несырьевых товаров на экспорт по ставке 10%, п.7 ст.164 НК'; en = '39 - Sale of non-commodity goods for export at a rate of 10%, paragraph 7 of Article 164 of the Tax Code'"));
		СписокКодовОпераций.Добавить("40", НСтр("ru = '40 - Реализация работ (услуг) в отношении экспортируемых товаров по ставке 18%, пп.2.1-2.5,2.7 и 2.8 п.1, п.7 ст.164 НК'; en = '40 - Sale of works (services) in relation to exported goods at a rate of 18%, paragraphs 2.1-2.5, 2.7 and 2.8, paragraph 1, paragraph 7, Article 164 of the Tax Code'"));
		
		// Код, введенный в действие с 1 апреля 2024 года.
		СписокКодовОпераций.Добавить("47", НСтр("ru = '47 - Перепродажа товаров физических лиц, п.5.1, п.5.2 ст.154 НК'; en = '47 - Resale of goods of individuals, paragraph 5.1, paragraph 5.2 of Article 154 of the Tax Code'"));
	КонецЕсли;
	
	Элементы.КодВидаОперации.СписокВыбора.Очистить();
	Для Каждого ТекЭлем Из СписокКодовОпераций Цикл
		Элементы.КодВидаОперации.СписокВыбора.Добавить(ТекЭлем.Значение, ТекЭлем.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНадписьКодВидаОперации()
	ТекущийКод = Элементы.КодВидаОперации.СписокВыбора.НайтиПоЗначению(Объект.КодВидаОперации);
	НадписьВидОперации = ?(ТекущийКод = Неопределено, "", Сред(ТекущийКод.Представление, 5));
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтоги()
	Если Объект.СуммаНДС = 0 Тогда
		Элементы.ДекорацияБезНДС.Видимость = Истина;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.СуммаДокумента.Заголовок = "Всего";
	Иначе
		Элементы.ДекорацияБезНДС.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Истина;
	    Элементы.СуммаДокумента.Заголовок = "Всего с НДС";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
